#### SeriesやDataFrameに関数を適用する方法（map, apply, applymapメソッド）

In [2]:
import pandas as pd
import numpy as np

In [3]:
s1 = pd.Series([7000,5000,23000,2500,12000])
s1

0     7000
1     5000
2    23000
3     2500
4    12000
dtype: int64

In [4]:
def double(x):
    return x * 2

In [5]:
s1.map(double)

0    14000
1    10000
2    46000
3     5000
4    24000
dtype: int64

In [6]:
s1.map(lambda x: x * 2)

0    14000
1    10000
2    46000
3     5000
4    24000
dtype: int64

In [7]:
s1.map(lambda x: '1万円以上' if x >= 10000 else '1万円未満')

0    1万円未満
1    1万円未満
2    1万円以上
3    1万円未満
4    1万円以上
dtype: object

In [8]:
def f_rank(x):
    if x >= 20000:
        return 'S'
    elif x >= 10000:
        return 'A'
    elif x >= 5000:
        return 'B'
    else:
        return 'C'

In [9]:
s1.map(f_rank)

0    B
1    B
2    S
3    C
4    A
dtype: object

In [10]:
s1.map(np.square)

0     49000000
1     25000000
2    529000000
3      6250000
4    144000000
dtype: int64

In [12]:
# s1.sum()
s1.mean()

9900.0

#### 文字列Seriesとmapメソッド

In [14]:
s2 = pd.Series(['スカートSkirt','ニットKnit','ジャケットJacket','シャツShirt','ロングパンツSlacks'])
s2

0       スカートSkirt
1         ニットKnit
2     ジャケットJacket
3        シャツShirt
4    ロングパンツSlacks
dtype: object

In [15]:
s2.map(lambda x: x[0])

0    ス
1    ニ
2    ジ
3    シ
4    ロ
dtype: object

In [17]:
import re
s2.map(lambda x: re.findall('[A-z]+', x))

0     [Skirt]
1      [Knit]
2    [Jacket]
3     [Shirt]
4    [Slacks]
dtype: object

In [18]:
s3 = pd.Series(['スカートSkirt','ニットKnit','ジャケットJacket','シャツShirt','BottomsロングパンツSlacks'])
s3

0              スカートSkirt
1                ニットKnit
2            ジャケットJacket
3               シャツShirt
4    BottomsロングパンツSlacks
dtype: object

In [19]:
s3.map(lambda x: re.findall('[A-z]+', x))

0              [Skirt]
1               [Knit]
2             [Jacket]
3              [Shirt]
4    [Bottoms, Slacks]
dtype: object

In [20]:
s4 = pd.Series(['スカートSkirt','ニットKnit','ジャケットJacket','シャツShirt',np.nan])
s4

0      スカートSkirt
1        ニットKnit
2    ジャケットJacket
3       シャツShirt
4            NaN
dtype: object

In [21]:
d = {'ジャケットJacket': 'Outer', 'スカートSkirt': 'Bottoms', 'ニットKnit': 'Tops', 'ワンピースOnepiece': 'Onepiece'}
d

{'ジャケットJacket': 'Outer',
 'スカートSkirt': 'Bottoms',
 'ニットKnit': 'Tops',
 'ワンピースOnepiece': 'Onepiece'}

In [22]:
s4.map(d)

0    Bottoms
1       Tops
2      Outer
3        NaN
4        NaN
dtype: object

In [24]:
s4.map('{}を買います。'.format, na_action='ignore')

0      スカートSkirtを買います。
1        ニットKnitを買います。
2    ジャケットJacketを買います。
3       シャツShirtを買います。
4                  NaN
dtype: object

In [25]:
s1

0     7000
1     5000
2    23000
3     2500
4    12000
dtype: int64

In [26]:
s1.apply(double)

0    14000
1    10000
2    46000
3     5000
4    24000
dtype: int64

In [27]:
s1.apply(lambda x: x * 2)

0    14000
1    10000
2    46000
3     5000
4    24000
dtype: int64

In [28]:
s1.apply(lambda x: '1万円以上' if x >= 10000 else '1万円未満')

0    1万円未満
1    1万円未満
2    1万円以上
3    1万円未満
4    1万円以上
dtype: object

In [29]:
s1.apply(f_rank)

0    B
1    B
2    S
3    C
4    A
dtype: object

In [30]:
def f_tax(x, tax):
    return x * tax + x

In [32]:
s1.apply(f_tax, args=(0.1,))

0     7700.0
1     5500.0
2    25300.0
3     2750.0
4    13200.0
dtype: float64

In [33]:
s2

0       スカートSkirt
1         ニットKnit
2     ジャケットJacket
3        シャツShirt
4    ロングパンツSlacks
dtype: object

In [34]:
s2.apply(lambda x: x[0])

0    ス
1    ニ
2    ジ
3    シ
4    ロ
dtype: object

In [35]:
s2.apply(lambda x: re.findall('[A-z]+', x))

0     [Skirt]
1      [Knit]
2    [Jacket]
3     [Shirt]
4    [Slacks]
dtype: object

In [37]:
s4.apply('{}を買います。'.format)

0      スカートSkirtを買います。
1        ニットKnitを買います。
2    ジャケットJacketを買います。
3       シャツShirtを買います。
4            nanを買います。
dtype: object

In [46]:
df = pd.DataFrame(
[[11000, 6000, 8000],[5000, 12000, 6000],[4000, 5000, 9000]], columns=['1日', '2日', '3日'], index=['Aさん', 'Bさん', 'Cさん'] )
df

        1日     2日    3日
Aさん  11000   6000  8000
Bさん   5000  12000  6000
Cさん   4000   5000  9000

In [47]:
df * 2

        1日     2日     3日
Aさん  22000  12000  16000
Bさん  10000  24000  12000
Cさん   8000  10000  18000

In [48]:
df = df.applymap(lambda x : x *2)
df

        1日     2日     3日
Aさん  22000  12000  16000
Bさん  10000  24000  12000
Cさん   8000  10000  18000

In [49]:
df.applymap(lambda x: '1万円以上' if x >=10000 else '1万円未満')

        1日     2日     3日
Aさん  1万円以上  1万円以上  1万円以上
Bさん  1万円以上  1万円以上  1万円以上
Cさん  1万円未満  1万円以上  1万円以上

In [50]:
df.applymap(f_rank)

    1日 2日 3日
Aさん  S  A  A
Bさん  A  S  A
Cさん  B  A  A

In [52]:
# df.applymap(f_tax, args=(0.1,))

In [53]:
df.mask(df < 10000, '1万円未満')

        1日     2日     3日
Aさん  22000  12000  16000
Bさん  10000  24000  12000
Cさん  1万円未満  10000  18000

In [54]:
df < 10000

        1日     2日     3日
Aさん  False  False  False
Bさん  False  False  False
Cさん   True  False  False

In [55]:
df.where(df < 10000, '1万円以上')

        1日     2日     3日
Aさん  1万円以上  1万円以上  1万円以上
Bさん  1万円以上  1万円以上  1万円以上
Cさん   8000  1万円以上  1万円以上

In [57]:
df.applymap(np.square)

            1日         2日         3日
Aさん  484000000  144000000  256000000
Bさん  100000000  576000000  144000000
Cさん   64000000  100000000  324000000

In [59]:
df2 = pd.DataFrame([['スカートSkirt', 'ニットKnit', 'ジャケットJacket'],
                    ['シャツShirt', 'ロングパンツSlacks', 'ワンピースOnepiesce']],
                   columns=['x', 'y', 'z'])
df2

           x             y               z
0  スカートSkirt       ニットKnit     ジャケットJacket
1   シャツShirt  ロングパンツSlacks  ワンピースOnepiesce